{
  "architectures": ["LlamaForCausalLM"],
  "model_type": "llama",
  "activation_function": "silu",
  "hidden_act": "silu",
  "hidden_size": 4096,
  "intermediate_size": 14336,
  "num_attention_heads": 32,
  "num_key_value_heads": 8,
  "num_hidden_layers": 1,
  "vocab_size": 128256,
  "max_position_embeddings": 1048576,
  "ffn_type": "llama",
  "rope_theta": 500000.0,
  "rms_norm_eps": 1e-05,
  "attention_bias": false,
  "mlp_bias": false,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "initializer_range": 0.02,
  "use_cache": true,
  "bos_token_id": 128000,
  "eos_token_id": 128001,
  "transformers_version": "4.39.3"
}